{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.15,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "accident_report",
    "1": "account_issue",
    "2": "app_not_working",
    "3": "apply_coupon",
    "4": "cancel_by_driver",
    "5": "cancel_ride",
    "6": "cancellation_fee_issue",
    "7": "cannot_contact_driver",
    "8": "double_payment",
    "9": "driver_late",
    "10": "driver_misbehavior",
    "11": "driver_not_arrived",
    "12": "emergency_sos",
    "13": "fare_breakup",
    "14": "goodbye",
    "15": "greeting",
    "16": "help_request",
    "17": "invoice_request",
    "18": "login_problem",
    "19": "long_route_taken",
    "20": "lost_item",
    "21": "offer_not_applied",
    "22": "payment_failed",
    "23": "payment_issue",
    "24": "payment_method_change",
    "25": "rash_driving",
    "26": "refund_not_received",
    "27": "refund_request",
    "28": "refund_status",
    "29": "ride_not_started",
    "30": "ride_started_without_user",
    "31": "route_issue",
    "32": "safety_issue",
    "33": "scheduled_ride_issue",
    "34": "thank_you",
    "35": "track_ride",
    "36": "unknown_intent",
    "37": "update_profile",
    "38": "wrong_drop_location",
    "39": "wrong_fare_charged",
    "40": "wrong_pickup_location"
  },
  "initializer_range": 0.02,
  "label2id": {
    "accident_report": 0,
    "account_issue": 1,
    "app_not_working": 2,
    "apply_coupon": 3,
    "cancel_by_driver": 4,
    "cancel_ride": 5,
    "cancellation_fee_issue": 6,
    "cannot_contact_driver": 7,
    "double_payment": 8,
    "driver_late": 9,
    "driver_misbehavior": 10,
    "driver_not_arrived": 11,
    "emergency_sos": 12,
    "fare_breakup": 13,
    "goodbye": 14,
    "greeting": 15,
    "help_request": 16,
    "invoice_request": 17,
    "login_problem": 18,
    "long_route_taken": 19,
    "lost_item": 20,
    "offer_not_applied": 21,
    "payment_failed": 22,
    "payment_issue": 23,
    "payment_method_change": 24,
    "rash_driving": 25,
    "refund_not_received": 26,
    "refund_request": 27,
    "refund_status": 28,
    "ride_not_started": 29,
    "ride_started_without_user": 30,
    "route_issue": 31,
    "safety_issue": 32,
    "scheduled_ride_issue": 33,
    "thank_you": 34,
    "track_ride": 35,
    "unknown_intent": 36,
    "update_profile": 37,
    "wrong_drop_location": 38,
    "wrong_fare_charged": 39,
    "wrong_pickup_location": 40
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.3,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "vocab_size": 30522
}
